Tekla Open API Reference for Tekla Structures 2025
ImageComboBox Properties
The ImageComboBox type exposes the following members.
Properties
Name | Description
DefaultValue
 Gets or sets the default value in the image combo box.
OptionList
 Gets or sets the elements of the option list, the images that are in the image combo box.
SelectedIndex
 Gets or sets the selected index of the image in the image combo box.
SelectedItem
 Gets or sets the selected image in the image combo box.
Top
See Also
Reference
ImageComboBox Class
Tekla.Structures.Dialog.UIControls Namespace